Repository: winfreddy88/RISCOS5
Catalog: gpl/Unix/Sources/Networking/cvsd/debian/po/*.po
Languages: cs

source: Location of chroot jail:
cs: Umístìní chroot vìzení:

source: cvsd can run in a chroot jail. This is the preferred method of operation. Specify the location of the chroot jail. If you make this 'none' no chroot jail will be created and used. A chroot file hierarchy will be created in the specified location.
cs: cvsd mù¾e bì¾et v tzv. chroot vìzení (chroot jail). Toto je preferovaný zpùsob provozu. Zadejte umístìní chroot vìzení. Pokud zadáte 'none', ¾ádné vìzení vytvoøeno a pou¾íváno nebude. Na zadaném umístìní bude vytvoøena chroot souborová hierarchie.

source: The maximum number of connections that can be handled:
cs: Maximální poèet spojení, která mohou být obslou¾ena:

source: It is possible to specify a maximum number of connections that cvsd can handle simultaneously. Specifying 0 (zero) will put no limit to the number of connections.
cs: Je mo¾né zadat maximální poèet spojení, která mù¾e cvsd obslou¾it zároveò. 0 (nula) znamená ¾ádný limit na poèet spojení.

source: Nice value cvsd should run at:
cs: Hodnota nice, se kterou má cvsd bì¾et:

source: cvsd can be run at reduced priority so it will not take up too many resources, especially if a user specifies a -z option to cvs. The priority can also be increased (negative value here).
cs: cvsd mù¾e bì¾et se sní¾enou prioritou, tak¾e nebude spotøebovávat pøíli¹ mnoho prostøedkù, zvlá¹tì kdy¾ u¾ivatel zadá volbu -z u cvs. Priorita mù¾e být také zvý¹ena (zde záporná hodnota).

source: Umask cvsd should run at:
cs: Maska práv, kterou má cvsd pou¾ívat:

source: Specify the umask cvsd and cvs should use when creating files.
cs: Zadejte masku práv, kterou mají cvsd a cvs pou¾ívat pøi vytváøení souborù:

source: The umask should be specified as an octal value and represents the permissions that should be taken away when creating a file (e.g. using 027 will create files with mode 640 or rw-r-----).
cs: Maska práv by mìla být zadána jako hodnota v osmièkové soustavì a reprezentuje práva, která mají být odebrána pøi vytváøení souboru (napø. pou¾ití masky 027 bude vytváøet soubory s právy 640 neboli rw-r-----).

source: Address and port on which cvsd will listen:
cs: Adresa a port, na kterém bude cvsd naslouchat:

source: With the first argument you can specify the address cvsd should listen on. The '*' address specifies that cvsd should listen on all addresses. You can specify a IPv4 address, IPv6 address, a hostname or '*'.
cs: Jako první argument mù¾ete zadat adresu, na které má cvsd naslouchat. Adresa '*' znamená, ¾e má cvsd naslouchat na v¹ech adresách. Mù¾ete zadat IPv4 adresu, IPv6 adresu, hostitelské jméno nebo '*'.

source: The second argument is the service name (e.g. cvspserver) or port number (default 2401) cvsd will listen on.
cs: Druhý argument je jméno slu¾by (napø. cvspserver) nebo èíslo portu (výchozí je 2401), na kterém bude cvsd naslouchat.

source: The address and port should be separated by a space and you can specify multiple address-port combinations by separating them with spaces.
cs: Adresa a port by mìly být oddìleny mezerou a mù¾ete zadat více kombinací adresa-port oddìlených mezerami.

source: Repositories to serve:
cs: Repozitáøe k obsluhování:

source: The whole idea of cvsd is to serve repositories. Specify a colon ':' separated list of repositories to serve. The location of these repositories is relative to the specified chroot jail (${rootjail}) and should start with a '/'.
cs: Celá my¹lenka cvsd je obsluhovat repozitáøe. Zadejte seznam repozitáøù oddìlených dvojteèkou ':', které se mají obsluhovat. Umístìní tìchto repozitáøù je relativní vzhledem k zadanému chroot vìzení (${rootjail}) a mìlo by zaèínat s '/'.

source: The repositories here should be initialized by hand with something like 'cvs -d ${rootjail}/myrepos init' after which passwords can be set with 'cvsd-passwd ${rootjail}/myrepos anonymous'. See the file /usr/share/doc/cvsd/README.gz for details on creating repositories.
cs: Zde zadané repozitáøe by mìly být ruènì inicializovány pomocí nìèeho jako 'cvs -d ${rootjail}/myrepos init', po èem¾ mohou být nastavena hesla pomocí 'cvsd-passwd ${rootjail}/myrepos anonymous'. Na detaily k vytváøení repozitáøù se podívejte do souboru /usr/share/doc/cvsd/README.gz.

source: coredumpsize
cs: velikost core souboru

source: cputime
cs: procesorový èas

source: datasize
cs: velikost dat

source: filesize
cs: velikost souboru

source: memorylocked
cs: uzamèená pamì»

source: openfiles
cs: otevøené soubory

source: maxproc
cs: maximum procesù

source: memoryuse
cs: vyu¾ití pamìti

source: stacksize
cs: velikost zásobníku

source: virtmem
cs: virtuální pamì»

source: Select resources of pserver processes to limit:
cs: Vyberte zdroje procesù pserveru, které se mají omezit:

source: The pserver wrapper can be configured to limit the resource usage that a pserver process can have. These resource limits will be set on each pserver process and not on the wrapper.
cs: Spou¹tìcí program pserveru mù¾e být nastaven na omezení vyu¾ití zdrojù, které mù¾e mít proces pserveru. Tyto limity zdrojù budou aplikovány na ka¾dý proces pserveru a ne na spou¹tìcí program.

source: Choose from the list the resources that you want to limit. You will be asked to specify limits about every resource you selected here.
cs: Vyberte ze seznamu zdroje, které chcete omezit. Budete tázáni k zadání limitù pro ka¾dý zdroj, který zde vyberete.

source: Note that not all resources may be available on all systems and that resources may be system and kernel specific so use these with caution. The results of exceeding the set limits may also be system specific but will most likely stop the cvs process and close the connection (may be problematic with write access to cvs repository).
cs: Uvìdomte si, ¾e ne v¹echny zdroje mohou být dostupné na v¹ech systémech a ¾e zdroje mohou být systémovì nebo jadernì specifické, tak¾e pou¾ívejte tato omezení opatrnì. Následky pøekroèení nastavených limitù také mohou být systémovì specifické, ale nejpravdìpodobnìji se ukonèí proces cvs a zavøou se spojení (mù¾e být problematické s pøístupem s právy zápisu do cvs repozitáøe).

source: Maximum file size of a core dump:
cs: Maximální velikost souboru výpisu pamìti (core dump):

source: Set this to 0 (zero) (should be the system default) to prevent core dumps. Otherwise this limits the size of core dumps to the specified value.
cs: Nastavte na 0 (nula) (mìlo by být v systému výchozí) pro zamezení výpisù pamìti. Jinak je to omezení velikosti výpisù pamìti na zadanou hodnotu.

source: This value may be specified with a suffix of 'b' (bytes), 'k' (1024 bytes) or 'm' (1024*1024 bytes), where 'k' is the default.
cs: Tato hodnota mù¾e být zadána s pøíponou 'b' (bytù), 'k' (1024 bytù) nebo 'm' (1024*1024 bytù), kde 'k' je výchozí.

source: Maximum amount of cpu time consumed:
cs: Maximální mno¾ství spotøebovaného procesorového èasu:

source: This limits the number of cpu seconds the cvs process can use. This will prevent too much cpu time from being allocated to a single connection.
cs: Toto omezuje mno¾ství sekund, po které mù¾e proces cvs vyu¾ívat procesor. Zamezuje pøidìlení pøíli¹ mnoha procesorového èasu jednomu spojení.

source: This value can be formatted as 'mm:ss' or have a 'm' or 's' suffix where 's' is default.
cs: Tato hodnota mù¾e být formátována jako 'mm:ss' nebo mù¾e mít pøíponu 'm' nebo 's', kde 's' je výchozí.

source: Maximum size of program's data segment:
cs: Maximální velikost datového segmentu programu:

source: This limits the amount of memory the cvs program can use. This specific item limits the size of the data segment.
cs: Toto omezuje mno¾ství pamìti, kterou mù¾e program cvs pou¾ívat. Tato konkrétní mo¾nost omezuje velikost datového segmentu.

source: Maximum size of files created:
cs: Maximální velikost vytváøených souborù:

source: This limits the maximum size of a file created by cvs. Note that the cvs pserver process needs to be able to create lock files and possibly write history or other files so don't set this to 0 (zero).
cs: Toto omezuje maximální velikost souboru vytvoøeného cvs. Proces cvs pserveru potøebuje mít mo¾nost vytváøet soubory zámku a mo¾ná historie zápisu nebo jiných souborù, tak¾e to nenastavujte na 0 (nulu).

source: Maximum amount of locked memory:
cs: Maximální mno¾ství uzamèené pamìti:

source: This limits the amount of memory the cvs process may lock. cvs probably doesn't need to lock any memory at all.
cs: Toto omezuje mno¾ství pamìti, kterou mù¾e proces cvs uzamèít. cvs pravdìpodobnì vùbec nepotøebuje nìjakou pamì» uzamykat.

source: Maximum number of open files:
cs: Maximální poèet otevøených souborù:

source: This limits the number of files and connections that the cvs process can have open at a single moment. The cvs process needs to access quite a few files so don't set this too low.
cs: Toto omezuje mno¾ství souborù a spojení, které mù¾e mít proces cvs otevøené v jednom momentu. Proces cvs potøebuje pøistupovat k nìkolika málo souborùm, tak¾e to nenastavujte pøíli¹ nízké.

source: Maximum number of processes:
cs: Maximální poèet procesù:

source: This limits the maximum number of processes that a single user may have. cvs may need to spawn additional processes to run scripts or do subtasks so don't set this too low.
cs: Toto omezuje maximální poèet procesù, které mù¾e mít jeden u¾ivatel. cvs mù¾e potøebovat vytvoøit dal¹í procesy pro spu¹tìní skriptù nebo podúloh, tak¾e to nenastavujte pøíli¹ nízké.

source: Maximum size of resident memory:
cs: Maximální velikost vyu¾ité pamìti:

source: This specifies the amount of physical memory a process may have.
cs: Toto urèuje mno¾ství fyzické pamìti, kterou mù¾e proces mít.

source: Maximum stack size:
cs: Maximální velikost zásobníku:

source: This limits the size of the stack.
cs: Toto omezuje velikost zásobníku.

source: Maximum amount of virtual memory allocated:
cs: Maximální mno¾ství alokované virtuální pamìti:

source: This limits the total amount of virtual memory a process may have allocated.
cs: Toto omezuje celkové mno¾ství virtuální pamìti, kterou mù¾e mít proces alokovanou.

source: Maximum number of threads:
cs: Maximální poèet vláken:

source: This limits the number of threads that a single process may have.
cs: Toto omezuje poèet vláken, která mù¾e mít jeden proces.

source: This is not available under Linux so it is not in the list for cvsd/limits. If Hurd has it it may be useful.
cs: Toto není pod Linuxem dostupné, tak¾e to není na seznamu pro cvsd/limits. Pokud to Hurd má, mù¾e to být u¾iteèné.

source: Remove chroot jail containing repositories?
cs: Ostranit chroot vìzení obsahující repozitáøe?

source: The following directory is configured as a chroot jail for cvsd: ${rootjail} You may choose to remove the chroot jail but you will also lose all the repositories inside the chroot jail. If you have not backed up your repositories you want to keep do not remove it now and manually remove it later once your repositories are safe.
cs: Následující adresáø je zkonfigurován jako chroot vìzení pro cvsd: ${rootjail} Mù¾ete zvolit odstranìní chroot vìzení, ale tím také ztratíte v¹echny repozitáøe v nìm. Pokud nemáte repozitáøe, které chcete uchovat, zálohované, nyní jej neodstraòujte a odstraòte jej ruènì a¾ budete mít repozitáøe zálohované.

source: If you do choose to remove the chroot directory, all directories under it will be removed, even if they are on another file system.
cs: Pokud zvolíte odstranìní chroot adresáøe, v¹echny adresáøe pod ním budou odstranìny, i kdy¾ jsou na jiném souborovém systému.

source: If you choose to keep the chroot jail please note that the cvsd user and group will be removed so uid and gid file information may no longer be consistent.
cs: Pokud zvolíte zachovat chroot vìzení, vìzte, ¾e u¾ivatel a skupina cvsd budou odstranìni, tak¾e informace o vlastníkovi a skupinì souboru nemusí být nadále konzistentní.
